<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest FireFoxESR disk image.</string>
    <key>Identifier</key>
    <string>com.github.evangardner.download.FireFoxESR</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FireFoxESR</string>
        <key>DOWNLOAD_URL</key>
        <string>http://download-origin.cdn.mozilla.net/pub/firefox/releases/68.3.0esr/mac/en-US/Firefox%2068.3.0esr.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
